app/views/user_books/_form.html.erb

    <%= form.label :user_id, style: "display: block" %>
    <%= form.select :user_id, User.order(:username).map { |user| [user.username, user.id] }, include_blank: true, id: "id_of_the_user_id_select_box" %>
---
SELECT "users".* FROM "users" ORDER BY "users"."username" ASC