app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "price", "published_date", "created_at", "updated_at") VALUES ('a', 'a', 1.0, '2025-02-03', '2025-02-03 07:26:54.769378', '2025-02-03 07:26:54.769378') RETURNING "id"

    def set_book
      @book = Book.find(params.expect(:id))
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1