app/controllers/user_books_controller.rb

SELECT "user_books".* FROM "user_books"
---
  def index
    @user_books = UserBook.all

INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES (1, 1, '2025-02-03 07:26:58.826555', '2025-02-03 07:26:58.826555') RETURNING "id"
---
  def create
    @user_book = UserBook.new(user_book_params)

    respond_to do |format|
      if @user_book.save

SELECT "user_books".* FROM "user_books" WHERE "user_books"."id" = 1 LIMIT 1
---
    def set_user_book
      @user_book = UserBook.find(params.expect(:id))